{
    "version": "https://jsonfeed.org/version/1",
    "title": "Live with Sass",
    "description": "",
    "home_page_url": "http://www.livewithsass.com",
    "feed_url": "http://www.livewithsass.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Kate / Sassafras"
    },
    "items": [
        {
            "id": "http://www.livewithsass.com/duolingo-streak-blue-blaze.html",
            "url": "http://www.livewithsass.com/duolingo-streak-blue-blaze.html",
            "title": "Why breaking my Duolingo streak is an act of self-care",
            "summary": "This year, I'm starting off the new year with a somewhat unorthodox choice: to break my 1294-day Duolingo streak. I know that's the opposite of most people's New Year's resolutions, so it probably warrants a bit of explanation. I've been using Duolingo since July 2015.",
            "content_html": "<p>This year, I'm starting off the new year with a somewhat unorthodox choice: to break my 1294-day Duolingo streak.</p>\n<p>I know that's the opposite of most people's New Year's resolutions, so it probably warrants a bit of explanation.</p>\n<p>I've been using Duolingo since July 2015. For most of that time, I've maintained streaks of activity, though before 2019 I didn't really care about the streak. I'd been wanting to learn French for years. Duolingo was easy to fit into my day, even when I traveled a lot for work. And at least once I almost \"finished\" the French course, only to have a redesign and restructure kick me back down several levels.</p>\n<p>I've had a few times where I got out of the habit. Thru-hiking the Appalachian Trail, for example: I didn't practice French at all then. And I was a bit patchy picking it back up after I finished the trail, until I started using a habit-tracking app that I set to ask me every day if I'd practiced Duolingo.</p>\n<p>In early 2020, I was on a several-months' streak and enjoying the consistency of the habit.</p>\n<p>Then, of course, I got sick with Covid and developed long Covid, with brain fog and fatigue. I already had a 200+ day streak at that point. And although I often could only make it through a review or a single lesson in a day, I clung stubbornly to this routine. I didn't drop my streak, despite being so full of fatigue I couldn't get out of bed and often forgetting English words I used all the time--French was much harder.</p>\n<p>Long Covid took so much from me for so long. I went from being an endurance athlete to, almost overnight, getting winded going up a flight of stairs. My heart rate was all over the place; my steel trap memory suddenly had gaping holes where things used to be. For a while I couldn't even focus enough to read. Duolingo was, in a very real way, one of the only habits that I successfully carried over from the before long Covid (BLC) times.</p>\n<p>I have stuck with it, working my way through every verb tense, learning a bunch of sentences that have no real meaning in real life. Just a couple weeks ago, I finally \"finished\" the French course (though, of course, thanks to more redesigns, I haven't actually finished unless I hit the Legendary level on all previous levels). I still wouldn't say I can speak French at all. My audio processing is pretty slow, and my speech isn't awesome. I can read it passably well. But I've developed a decent foundation.</p>\n<p>So why, you might be asking, did I give up that 1294-day streak?</p>\n<p>It's a multi-layered answer.</p>\n<p>The first part is that I hate the new UI and format they rolled out a few weeks ago. I was one of those learners who focused singularly on a given skill and worked all the way through it before moving on (which was a boon with my brain fog, since it often took staggering levels of repetition before I could bludgeon my memory to make space for things). The new layout makes that impossible, and it's left me feeling constantly insecure and confused.</p>\n<p>The second part is that I have achieved a chunk of the goal I set out for myself: I got all the way through the course, all levels (ignoring Legendary, which has only existed for a little while).</p>\n<p>But the third part is...harder to articulate.</p>\n<p>Why would I cut this one continuous thread of my BLC brain and life?</p>\n<p>For me, Duolingo was about setting an intention in my life (to rudimentarily learn French) and sticking to that intention. For a long time, that intention made me feel good. I did Duolingo every day (usually in the morning, sometimes at night). I learned things. It was fun.</p>\n<p>Even once I got into some of the trickier verb tenses that were pretty hard to \"intuitively\" wrap my head around and it felt more like work, it still felt good. My stressed and stretched-thin long Covid brain could still do this thing I used to be able to do. That felt important. It was an act of resistance against this poorly-defined, poorly-understood, untreatable illness.</p>\n<p>But here, starting 2023, coming up quite quickly on my 3rd year anniversary of having long Covid, I find that I want to let go of some of those threads to BLC me.</p>\n<p>There's a lot of grief with chronic illness. Lots of grief and lots of mourning. We lose so much: a sense of stability and predictability, the unexamined presumption of \"health\" as \"normal\", all the identities we once had that our bodies make unsustainable. The self basically disintegrates before our eyes and we are left trying to find some way to move forward. Some way to have hope when all of the specific things you once hoped for are no longer possible with the increasingly finite, wildly unpredictable resources your body allows.</p>\n<p>I've been reading Arthur W. Frank's <em>The Wounded Storyteller</em>. Frank identifies a few common narrative models that people with serious illness can follow: restitution, chaos, and quest. And I can see that evolution in my own thinking. I held onto Duolingo for a while because I assumed I'd recover and I didn't want to have lost my streak (restitution). Then I held onto it because everything in my life and my very self was dissolving, crumbling, and was so unpredictable I couldn't find words to describe it (chaos). It was a tiny moment of consistency in an otherwise tumultuous storm.</p>\n<p>But now, starting this year, I'm thinking a lot more about intentionality as it relates to long Covid. In discussing the importance of testimony and recognition with chronic illness, Frank says:</p>\n<blockquote>\n<p>The danger for ill people is that they are often taught how to be ill by professionals. Illness is not presented to the ill as a moral problem; people are not asked, after the shock of diagnosis has dulled sufficiently, what do you wish to <strong>become</strong> in this experience? What story do you wish to tell of yourself? How will you shape your illness, and yourself, in the stories you tell of it? (159)</p>\n</blockquote>\n<p>I can't fully answer these questions yet, though my posts here are one way I'm trying to find my way to those answers.</p>\n<p>What I do know is that I don't want to be clinging to some sense of what used to be normal. Even in the vague way that Duolingo has provided, there is always this subtle feeling of difference between how that experience is<em> now</em> vs. what it was like <em>before</em>.</p>\n<p>I don't want my story to be: here's this thing I used to do really easily and now I'm tenaciously sticking to it even though it's really hard and isn't fun or rewarding at all. That's empty stubbornness, and almost willful clinging to the past.</p>\n<p>Long Covid has taught me how expressly important it is, as a chronically ill person, to be adaptable. To define--and redefine--for yourself what a full life looks like. Because you're the only one who can. You're the only one who understands what feels like a reasonable challenge vs. an unachievable and almost cruel challenge.</p>\n<p>So I would like to redefine this. I'm walking away from Duolingo, but not learning French. My plan is to start trying to read more actual things in French, try to listen to some of the easy French podcasts, and seek out other alternatives that aren't as tidy as an app that tracks my completion but that can give me back some of those feelings of fulfillment and competence I had before. Free from the tyranny of the streak, my hope is that I can structure and pursue learning as it makes sense in my life.</p>\n<p>Resolutions are often about habits. They're about expressing an intention and then committing action to follow through on that intention.</p>\n<p>So my resolution is to let go of this highly structured but no longer purposeful habit and explore alternative habits that help me pick up the melody of the original goal but in a tune that my current body can carry.</p>\n<p>On the Appalachian Trail, there are a lot of places where you can choose to follow side trails--which are often more scenic and are sometimes shorter. The AT is marked with white blazes; the side trails are generally blue. On my thru-hike, I was a religious white blaze follower. It's taken me an extra 4+ years, nerve damage in my feet, and a chronic untreatable illness, but I think I'm finally coming around to the idea of blue-blazing. Because sometimes how you choose to make your way is even more important than the journey itself.</p>\n<p>And if my story here can be useful in any way, I hope that's what you take from it: you always can--and should--walk away from things that aren't serving you or are causing undue stress. You don't have to wield self-control like a mace. Offer your body and your mind a little grace and see what makes your life feel whole rather than full.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"http://www.livewithsass.com/media/posts/6/IMG_20180513_082713.jpg\" alt=\"Appalachian Trail sign. The sign reads &quot;Mau-Har Trail. Maupin Field Shelter 3.0&quot; with an arrow to the left. In marker, people have written several statements: &quot;Cheaters shortcut&quot;, &quot;Voldemort was a purist&quot;, and &quot;Take the blue blaze!&quot;\" width=\"4048\" height=\"3036\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"http://www.livewithsass.com/media/posts/6/responsive/IMG_20180513_082713-xs.jpg 300w ,http://www.livewithsass.com/media/posts/6/responsive/IMG_20180513_082713-sm.jpg 480w ,http://www.livewithsass.com/media/posts/6/responsive/IMG_20180513_082713-md.jpg 768w ,http://www.livewithsass.com/media/posts/6/responsive/IMG_20180513_082713-lg.jpg 1024w ,http://www.livewithsass.com/media/posts/6/responsive/IMG_20180513_082713-xl.jpg 1360w ,http://www.livewithsass.com/media/posts/6/responsive/IMG_20180513_082713-2xl.jpg 1600w\">\n<figcaption >Take the blue blaze!</figcaption>\n</figure>",
            "image": "http://www.livewithsass.com/media/posts/6/IMG_20180709_070625.jpg",
            "author": {
                "name": "Kate / Sassafras"
            },
            "tags": [
                   "longhaulerwithsass"
            ],
            "date_published": "2023-01-02T12:09:38-05:00",
            "date_modified": "2023-01-02T12:35:02-05:00"
        },
        {
            "id": "http://www.livewithsass.com/third-times-the-charm.html",
            "url": "http://www.livewithsass.com/third-times-the-charm.html",
            "title": "Third time&#x27;s the charm: Sass loses taste and smell yet again",
            "summary": "Earlier this week, my partner made a vegetarian curry dish with sweet potatoes, chickpeas, and rice. Three bites into the meal, I realized I couldn't taste the curry. At all. Since then, I've been paying attention and I'm back to where I was about a&hellip;",
            "content_html": "<p>Earlier this week, my partner made a vegetarian curry dish with sweet potatoes, chickpeas, and rice.</p>\n<p>Three bites into the meal, I realized I couldn't taste the curry. At all.</p>\n<p>Since then, I've been paying attention and I'm back to where I was about a year ago, with limited sense of taste and reduced sense of smell.</p>\n<p>When I mention this to most overall healthy people, they immediately ask me what I think caused it. Sometimes I answer this question by running through a list of vaguely logical options:</p>\n<ul>\n<li>About 4 weeks ago, I completed a 5k doing 60-second run-walk intervals. It was cold and my body hated it, my heart rate was higher than it had been for my training. The cold stressed my body and I almost puked by the end of the race. Maybe this had long-term repercussions.</li>\n<li>About 2 weeks ago, I got a flu shot. I was quite sick the day after, mildly okay two days after, and then quite sick again the day after that. I've been tired since then, back to the land of \"can't get enough sleep\". Maybe the flu shot was a bad idea (did it trigger a disproportionate inflammatory response in my immune system?). Or getting it \"so soon\" after the 5k was too much. Or maybe it's nothing.</li>\n<li>It's actually winter now. My body seems to hate the cold, so it could just be the fact of winter itself causing issues, somehow.</li>\n<li>It's actually winter now, so our forced air furnace is running. My body doesn't seem to like the HVAC system in our rental, so maybe that's triggering it. Or, in tandem with the cold. Or, in tandem with any of the other bullet points listed above.</li>\n</ul>\n<p>But what I really want to say to them is: I have a long Covid body. 1 + 1 stopped adding up to 2 in my body 2.5+ years ago. There doesn't have to be a reason. Sometimes you just hit a point of stress that causes a flare of symptoms, and it's hard to say exactly what it is.</p>\n<p>All I can do at this point is to try to remove stressors, get lots of rest, and hope.</p>\n<p>Though there are things I don't tell them.</p>\n<p>I don't tell them that the night I ate that curry, I went into the bathroom to take my shower and sobbed through my whole shower.</p>\n<p>Because you think you've found a way to manage your illness, you think it kind of makes sense and now you can make things livable. And then something that you worked really hard to regain disappears again, just like that, and you're reminded not only that none of it is within your control, not only that the doctors still can't do diddly squat to help you, but also that every time you lose it, you're going to be full of grief. There is no \"normal\", anymore. There's a baseline that you try to maintain and some days are great and some are still really shitty. And you're not really sure how you managed to get good days for a while once the bad ones return.</p>\n<p>I also don't tell them that when I voiced fear about the 5k or the flu shot tipping my body over the edge, they told me I shouldn't live my life in fear and to just do it. What I want to scream at them is that this isn't irrational fear: given the data I have to work with, it is completely legitimate, warranted fear. The idea that I might have somehow brought this on myself by these \"risky\" actions--actions which most everyone else didn't consider risky at all--is so sour I want to spit it out of my mouth. (Or it would be, if I could taste sour things.)</p>\n<p>I cried, but I also wanted to scream. I wanted to rage around the house and break things, and just...lash out with all of it. I didn't. I sobbed in the shower and went to bed. Then I managed to tell my whole team at work that I'm sicker again and will need some grace and flexibility; please don't schedule back-to-back meetings with me for hours on end. And I started testing what I can and can't taste and smell. The losses aren't as bad as 2020 and 2021's were, I still have a few flavors I can taste that aren't salt or hot sauce, and a few smells that aren't burning things and dog farts (which were the two smells I could smell for all of 2020 and a good chunk of 2021).</p>\n<p>But if there's all this stuff I won't say to most people, why write about it here?</p>\n<p>Well, the first reason is simple: I need to speak this out so it doesn't just fester in my body and turn me bitter and rageful. Venting some steam.</p>\n<p>But also: somewhere out there, I imagine there's another spoonie who's also going through a recurring loss of a good baseline. And that loss slapped them in the face, took their breath away, and left them sobbing and confused and lonely and angry and sad all at once. Whatever that loss was, it probably seemed small to outsiders (aren't you used to this by now?) and yet it feels huge and overwhelming and how on earth does any of us go on living.</p>\n<p>So you, random chronically ill person I don't actually know: I'm writing this for you. You're not alone. That rage and grief and confusion you're feeling? It's totally normal for your situation. There are lots of us who go through the same things. I'm here to write a little of it down so that we can both recognize that the emperor has no f*cking clothes on and maybe laugh or cry a bit about how absurd it is that no one else notices.</p>\n<p>Also, if your sense of taste and smell still work, please go eat some curry and revel in what an amazing thing those senses are. Lean your face over the bowl or plate, close your eyes, and inhale deeply and just f*cking luxuriate in it. Take a couple bites and let them sit in your mouth a little longer so you can get the full wave of different flavors. And then send me a single thought of flare recovery vibes. 🙃</p>",
            "image": "http://www.livewithsass.com/media/posts/5/PXL_20221119_203614849.jpg",
            "author": {
                "name": "Kate / Sassafras"
            },
            "tags": [
                   "longhaulerwithsass"
            ],
            "date_published": "2022-12-16T17:18:45-05:00",
            "date_modified": "2022-12-16T17:27:58-05:00"
        },
        {
            "id": "http://www.livewithsass.com/on-resiliency.html",
            "url": "http://www.livewithsass.com/on-resiliency.html",
            "title": "On resiliency: Why I ditched the &quot;you&#x27;ll get better&quot; narrative",
            "summary": "As I've thought about Hike the Hike You've Been Given, and what that has looked like in my thru-hiking and long Covid life, I've realized that I can probably distill it down even further. Accepting the hike or chronic illness or whatever it is you've been&hellip;",
            "content_html": "<p>As I've thought about <a href=\"http://www.livewithsass.com/hike-the-hike-youve-been-given.html\" title=\"Hike the Hike You've Been Given\" target=\"null\">Hike the Hike You've Been Given</a>, and what that has looked like in my thru-hiking and long Covid life, I've realized that I can probably distill it down even further. </p>\n<p>Accepting the hike or chronic illness or whatever it is you've been given is also about reclaiming the story of your life. It's taking a story that has some seriously negative turns to it and viewing it in a positive way.</p>\n<p>I'm not talking about forced or toxic positivity. This isn't let's pretend it's all sunshine and roses.</p>\n<p>It is, instead, to focus on a core thread in the story itself.</p>\n<p>For me, that thread is resiliency.</p>\n<p>I have to thank Amy, the long Covid therapist I saw, for this word. It has a lot of power. 🙌</p>\n<p class=\"dropcap\">One of the things I've found hardest about having long Covid is that a lot of very well-intentioned, well-meaning people spent weeks and months telling me that I'd \"get back to where I was before in no time.\" We've probably all said something like this to a friend going through a break-up, a job change, or other tough times, and it's meant as a reassurance, a way of saying: hey, I know it sucks right now, but this is abnormal and you'll get back to normal soon enough. Chin up.</p>\n<p>But there are times that this is the complete opposite of reassuring.</p>\n<p>First of all, it assumes that the \"normal\" state of life for most of us is one of stability and a fixed, defined identity. That's patently false.</p>\n<p>\"Normal\" life is a rollercoaster. Things are always falling apart and coming back together, then falling apart again. Stuff breaks. We get stressed, we get anxious, we get depressed.</p>\n<p>Trying to define \"normal\" as somehow absent of those things has this implicit effect of making us feel bad for not being \"normal\". And if your situation is turning out to be more chronic and long-lasting--like long Covid, for example--it makes you feel like you will never be \"normal\" again. No bueno.</p>\n<p>Thru-hikers often intuitively pick up on this. The trail gives you endless ups and downs, every day. You might score a beautiful camping spot only to have it downpour for the next four days, and you're putting on still soaking wet socks and shirt. You might push hard to get to a summit that's supposed to have gorgeous views just to have it walled in with fog. You might get an amazing care package full of love and good food from friends but it weighs more than the rest of your pack combined. Or the trail you're supposed to be hiking might look like this:</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"http://www.livewithsass.com/media/posts/3/IMG_20180623_102309-2.jpg\" alt=\"A steep uphill sloped covered in a jumble of rocks. In the distance at the top of the hill, a tree with AT white trail blazes indicates the rock jumble IS the trail.\" width=\"3036\" height=\"4048\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"http://www.livewithsass.com/media/posts/3/responsive/IMG_20180623_102309-2-xs.jpg 300w ,http://www.livewithsass.com/media/posts/3/responsive/IMG_20180623_102309-2-sm.jpg 480w ,http://www.livewithsass.com/media/posts/3/responsive/IMG_20180623_102309-2-md.jpg 768w ,http://www.livewithsass.com/media/posts/3/responsive/IMG_20180623_102309-2-lg.jpg 1024w ,http://www.livewithsass.com/media/posts/3/responsive/IMG_20180623_102309-2-xl.jpg 1360w ,http://www.livewithsass.com/media/posts/3/responsive/IMG_20180623_102309-2-2xl.jpg 1600w\">\n<figcaption >No, this is not a random jumble of rocks. See the trail blaze at the very top? It's the trail. :)</figcaption>\n</figure>\n<p class=\"dropcap\">But more than this false measure of \"normal\", the entire piece of advice strips you of the story of overcoming difficulties. Of being resilient.</p>\n<p>When friends or family told me I'd get back to normal before I knew it, or back to where I'd been health- or fitness-wise, my response changed over time.</p>\n<p>In the first few days and weeks, it was a kind of reassurance. This was temporary, and the reassurance felt good.</p>\n<p>But as this dragged on to months and then years, it seemed flat and full of denial.</p>\n<p>And eventually, it felt gross to me because the fact was: I'd been through a lot of shit <em>and I wanted to celebrate that, own it, and have people recognize it.</em></p>\n<p>Let's be real: it's really shitty to have long Covid. It's weeks and months of riding a rollercoaster of exhaustion and fatigue, where it takes every ounce of will-power you might have just to get out of bed and do even simple things. The brain fog can be mild (taking a split-second longer to remember a thing) or thick and heavy (forgetting names of people, forgetting major emotional events just days after they happen).</p>\n<p>I still have very little sense of smell or taste two years in. I've had random allergic skin reactions to a range of foods I used to eat regularly. I have persistent tinnitus in one ear and hypersensitive hearing the rest of the time. Each day is like a roulette wheel of symptoms, and though my daily baseline has improved with time, it's still a roulette wheel. The consequences are just a bit more expected and predictable now than they were in 2020.</p>\n<p>When you tell me I'll be back where I was, you basically erase all of that struggle because you don't acknowledge it. You sweep it under the rug as a \"temporary\" thing. I'm two years in. This isn't temporary. This is my new normal. And it's a really hard normal.</p>\n<p class=\"dropcap\">Quite frankly: it's the biggest endurance effort I've ever undertaken. Way harder than thru-hiking, which I could choose to quit at any time. I don't get to opt out of this reality. There are no zero days, no trail magic, no quitting and going home. Like Groundhog Day, I wake up to this same reality no matter what I do.</p>\n<p>I'm not saying all of that so that you'll have sympathy or pity for me.</p>\n<p>I'm saying it because: I'm resilient. I continue to live in this shifting roulette, and I do it reasonably gracefully. Most people have no idea how rough my day to day life is. I'm still working, still walking my dog, still cooking even if I can't properly taste what I make. I have some dreams and some hopes now, too, which was unthinkable a year ago.</p>\n<p>I'm a resilient warrior. I've been through so much, and continue to go through so much.</p>\n<p>So don't tell me I'll get back to being who I used to be. That woman is long gone. The woman I am now is much wiser even if her brain doesn't work as well. She's gentler, more thoughtful, generally a better listener. She thinks more from her heart than her head. She considers that people bring all kinds of baggage to each interaction that might not be remotely visible.</p>\n<p>She's a kinder person, even if she has way less energy.</p>\n<p>And I want you to see her and know that She. Is. Me. Not that picture you have of me from 2.5 years ago. Messy, exhausted, fatigued me, now. And I'll continue to grow and change as I keep living with this condition. I'll keep being in turns angry and disappointed in medical science for not being able to help me, and I'll keep trying to figure out ways to help myself.</p>\n<p class=\"dropcap\">In so many ways, all of us--every single damn one of us--need to drop this story of stability being \"normal\" and this other stuff being a detour or a distraction. It's neither. Life is always this mixture of more stable and less stable things, of pleasure and pain, of mountain summits and grueling rough terrain. If there's one thing I wish I could tell my pre-long-Covid self, it's that: stop thinking it's supposed to be great all the time and you're somehow messing up if it's not. It's supposed to be a grab bag, and the people who are living with sass are rolling with whatever comes out of that bag, every day.</p>\n<p>Don't try to get back to some previously stable/amazing point in your life--recognize that you're a more amazing person now having gone through all that stuff and continuing to go through and still getting up and living your life anyway.</p>\n<p>Find your resilient story. I promise you, it's in there. You've overcome a lot, and you'll overcoming a lot, and THAT is the story of your life. </p>",
            "image": "http://www.livewithsass.com/media/posts/3/IMG_20180517_111208.jpg",
            "author": {
                "name": "Kate / Sassafras"
            },
            "tags": [
                   "longhaulerwithsass"
            ],
            "date_published": "2022-04-01T12:41:54-04:00",
            "date_modified": "2022-04-01T12:50:08-04:00"
        },
        {
            "id": "http://www.livewithsass.com/about.html",
            "url": "http://www.livewithsass.com/about.html",
            "title": "About",
            "summary": "Hi, I'm Kate, also known as Sassafras. In 2018, I hiked the Appalachian Trail, solo. I developed serious nerve problems in my feet but still completed my hike. In March of 2020, I contracted COVID. I soon developed what's called longhaul Covid or just long&hellip;",
            "content_html": "<p>Hi, I'm Kate, also known as Sassafras.</p>\n<p>In 2018, I hiked the Appalachian Trail, solo. I developed serious nerve problems in my feet but still completed my hike.</p>\n<p>In March of 2020, I contracted COVID. I soon developed what's called longhaul Covid or just long Covid.</p>\n<p>This site is my attempt to make sense of all those experiences and draw parallels between them. I hope these musings help other people facing challenging endurance efforts and chronic illnesses so that we can all live our lives with a little more sass.</p>",
            "image": "http://www.livewithsass.com/media/posts/2/IMG_20180428_082144_1.jpg",
            "author": {
                "name": "Kate / Sassafras"
            },
            "tags": [
            ],
            "date_published": "2022-04-01T11:51:30-04:00",
            "date_modified": "2022-04-01T12:01:41-04:00"
        },
        {
            "id": "http://www.livewithsass.com/hike-the-hike-youve-been-given.html",
            "url": "http://www.livewithsass.com/hike-the-hike-youve-been-given.html",
            "title": "Hike the Hike You&#x27;ve Been Given",
            "summary": "Before I began my hike, I had an image of what it would be like. Of course, I knew there would be rain and mud and miserable days, that my body would hurt, that my pack would feel too heavy. I imagined getting sick of&hellip;",
            "content_html": "<div>Before I began my hike, I had an image of what it would be like. Of course, I knew there would be rain and mud and miserable days, that my body would hurt, that my pack would feel too heavy. I imagined getting sick of foods, the grossness of unwashed clothing and my body. But underneath all of that, I thought my body would be basically fine: maybe some blisters, some bruises, some weight loss, but fundamentally fine.</div>\n<div> </div>\n<div>I'd been hiking for years, distance cycling and triathlon training 6 days a week for nearly a year. I'd managed Achilles and knee issues. I figured my triathlete body would kind of love \"only\" having to hike, and that I'd be pulling 20 or 30-mile days with no problem. I expected it to take me somewhere between 3-5 months, though I budgeted for longer just in case.</div>\n<div> </div>\n<div>The reality quickly became quite different. The nerve problems in my feet began at Fontana Dam, less than 200 miles into the nearly 2200-mile trail. My feet felt like they were being stabbed, or burned, or like I was walking on glass. With every step.</div>\n<div> </div>\n<div>Suddenly, my body, which had always submitted to nearly everything I'd pushed it to do with fairly minimal complaint (minus my overuse injuries), became foreign to me. I tried so many different solutions and treatments for my feet. I frequently cried on trail, in frustration, in pain. My miles slowed. I had to take far more frequent breaks than most of the people hiking around me, sometimes more than the retired guys I hiked with. I certainly wasn't keeping up with the 20-somethings.</div>\n<div> </div>\n<div>I knew, deep inside, that the only way to solve my foot problems was to quit.</div>\n<div> </div>\n<div>I also knew that if I quit, it would gnaw at me and I'd eventually find myself back out here, except with full knowledge of how awful it would be to my body, and having to save and plan and quit my job and put my things in storage all over again.</div>\n<div> </div>\n<div>My feet screamed at me every morning, every night, every time I took a break, every time I got up from taking a break, literally every step: stop. Stop. Stop.Though I considered the idea, I couldn't. I wished I could. (To this day, in some ways, part of me wishes I could have quit and saved my feet. But I am stubborn to a fault.)</div>\n<div> </div>\n<div>The traits I'd always had, which endurance sport training had further helped solidify, suddenly became foundational pillars of my day to day: endure. Adapt.</div>\n<div> </div>\n<div>But there was still so much pain, and I felt bitterness and resentment at my fellow hikers who had comparatively simple problems to manage--blisters, occasional injuries from falls, but nothing lingering.</div>\n<div> </div>\n<div>The hikers with feet like mine quit. That's what they did.</div>\n<div> </div>\n<div>In Virginia, as I stopped hiking or even camping with any of my tramily, I started to descend to really dark places. It was so unfair. This wasn't the hike I'd signed up for. This sucked.</div>\n<div> </div>\n<div>Two events changed my perspective. I can't remember the order, I will have to check my journals, but:</div>\n<ol>\n<li>I met Repeat and Three-Mile. Three-Mile, on his second attempt, trying to manage his fibromyalgia, already having had to take a break to see his doctors. I really only saw them a couple days, and we camped together one night (I shared my Sourpatch Kids with them). I asked him how he managed thru-hiking with fibromyalgia, how on earth he made that work. And we got into this conversation about the importance of the mind, and perspective. As he put it to me: \"It's like you're driving a bus. Your feet stepping on the ground are going on the gas and the brake, your hands on your hiking poles are like they're the steering wheel. You can't control what comes down the road at you, but you know what you can control? What you allow ON your bus.\" It was one of the more concrete explanations of deliberate focus and mindfulness I'd ever heard, and it came at a time when I desperately needed that perspective.</li>\n<li>My dad met me in Shenandoah National Park. We ate meals together, gave my friends trail magic, shared two different hotel rooms, drove portions of the scenic drive. I talked about my feet, how hard it was. He watched me get out of bed and almost fall over, have to use walls to help me stand up and balance until my feet \"woke up\" for the day. The last morning as we ate breakfast before parting ways, he looked at me over the table and said: \"I wish you were having more fun.\" It was like someone had punched me in the stomach. I wanted to cry. Instead, Dad dropped me back on trail, on a foggy, rainy day in the Shenandoahs when you couldn't see any of the beautiful views. And I started sobbing and talking to my dead mother as I went.</li>\n</ol>\n<div> </div>\n<div>I knew that I had lost my joy and enthusiasm. That I had let the pain and the struggle dominate my thoughts, and the more of my time and effort I put focusing on them, the larger they loomed.</div>\n<div> </div>\n<div>I worked to refocus myself to things that kept me more in the moment: photographing mushrooms (one of my day-hiking hobbies), saying \"Hi, little red eft\" to every red eft I saw on trail, shifting to as much solo stealth camping as I could to pick beautiful places to eat dinner and sleep.</div>\n<div> </div>\n<div>As I did this, I realized that what I had to let go of was the hike I thought I'd have. I had to embrace and hike the hike that I'd been given, instead. I never did a 30-mile day, never pulled the massive individual daily endurance efforts I imagined. I took frequent breaks, my pace was slower, I camped in weird places and soaked my feet in a lot of very cold water crossings. It forced me out of my body, in many ways. And when it was negative, I spent a lot of time in my head, in very neurotic places there. But as I consciously shifted my focus to the present and to accepting the hike I'd been given, this shifted me more into my heart, to remind myself how grateful I was for this opportunity.</div>\n<div> </div>\n<div>From then on, the worse my feet got (and they got quite bad), I told myself when I got up that I needed to treat the day as if it were my last day on trail. How would I want to spend my last day on trail? Miserable? Or joyful? That constant reminder of just how fragile and tenuous my hike was forced a different attitude and appreciation.</div>\n<div> </div>\n<div>In the end, my hike was much richer for it. I have watched snakes swim across Maine ponds, hung in my hammock with no human anywhere nearby through thunderstorms, watched the moon from my hammock. If I'd been pulling huge miles and taking fewer breaks, I don't know that I would have done as many of these things, or noticed them as much when I did, as I soaked my feet.</div>\n<div> </div>\n<div>My hike took 5.5 months.</div>\n<div> </div>\n<div>And there isn't a day now that I don't wish I wasn't back out there.</div>\n<div> </div>\n<div>Fast-forward 3 years, to 2021. It's about a month after the three-year trailiversary of finishing my thru-hike. I've had long Covid since I got sick with it in the end of March 2020. My body, once an endurance machine, is a constant roulette game: some days I feel okay, some days I have shortness of breath from having a conversation, often I'm totally exhausted. I haven't had a real workout in over a year, since they seemed to cause flares of the worst issues.</div>\n<div> </div>\n<div>In short, this life is not the life I expected to have.</div>\n<div> </div>\n<div>I can't say that I've been able to fully accept the life that long Covid has given me, yet. No one knows if this will last forever, if I might \"get better,\" and that uncertainty makes it rocky. Some days I am full of rage or sadness or depression or bleakness. Some days I do inch my way toward acceptance.</div>\n<div> </div>\n<div>The red efts are harder to find, basically nonexistent where I live. But I have a daily short hike with my dog Zola, and we look for mushrooms, and her sheer joy at being out on trail is infectious. This isn't the life or the hike that I expected or wanted. No one would choose this. But I am doing my best to live it to the fullest extent I can, within the ever-shifting parameters of my now chronically ill body.</div>\n<div> </div>\n<div>On the rough days, sometimes, I mutter to myself: \"Hike the hike you've been given, Sass.\" And I try to remember who Sassafras was, what she accomplished, and to remind myself that no matter what my body does, *I am still that hiker with sass*. No virus can take away that experience, that mindset, that tremendous accomplishment, that fortitude. I may be stuck on an endless endurance effort with no Katahdin ever in sight--and a dwindling sense that there will ever be a Katahdin, here--but I can still try to face each day as if it's my last on this adventure.</div>\n<div> </div>\n<div>Hi, little red eft.</div>",
            "image": "http://www.livewithsass.com/media/posts/1/IMG_20180508_170133.jpg",
            "author": {
                "name": "Kate / Sassafras"
            },
            "tags": [
                   "longhaulerwithsass",
                   "hikerwithsass"
            ],
            "date_published": "2021-11-21T16:43:00-05:00",
            "date_modified": "2022-12-16T17:28:37-05:00"
        }
    ]
}
