{
    "version": "https://jsonfeed.org/version/1",
    "title": "Live with Sass",
    "description": "",
    "home_page_url": "http://www.livewithsass.com",
    "feed_url": "http://www.livewithsass.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Kate / Sassafras"
    },
    "items": [
        {
            "id": "http://www.livewithsass.com/hike-the-hike-youve-been-given.html",
            "url": "http://www.livewithsass.com/hike-the-hike-youve-been-given.html",
            "title": "Hike the Hike You&#x27;ve Been Given",
            "summary": "Before I began my hike, I had an image of what it would be like. Of course, I knew there would be rain and mud and miserable days, that my body would hurt, that my pack would feel too heavy. I imagined getting sick of&hellip;",
            "content_html": "<div>Before I began my hike, I had an image of what it would be like. Of course, I knew there would be rain and mud and miserable days, that my body would hurt, that my pack would feel too heavy. I imagined getting sick of foods, the grossness of unwashed clothing and my body. But underneath all of that, I thought my body would be basically fine: maybe some blisters, some bruises, some weight loss, but fundamentally fine.</div>\n<div> </div>\n<div>I'd been hiking for years, distance cycling and triathlon training 6 days a week for nearly a year. I'd managed Achilles and knee issues. I figured my triathlete body would kind of love \"only\" having to hike, and that I'd be pulling 20 or 30-mile days with no problem. I expected it to take me somewhere between 3-5 months, though I budgeted for longer just in case.</div>\n<div> </div>\n<div>The reality quickly became quite different. The nerve problems in my feet began at Fontana Dam, less than 200 miles into the nearly 2200-mile trail. My feet felt like they were being stabbed, or burned, or like I was walking on glass. With every step.</div>\n<div> </div>\n<div>Suddenly, my body, which had always submitted to nearly everything I'd pushed it to do with fairly minimal complaint (minus my overuse injuries), became foreign to me. I tried so many different solutions and treatments for my feet. I frequently cried on trail, in frustration, in pain. My miles slowed. I had to take far more frequent breaks than most of the people hiking around me, sometimes more than the retired guys I hiked with. I certainly wasn't keeping up with the 20-somethings.</div>\n<div> </div>\n<div>I knew, deep inside, that the only way to solve my foot problems was to quit.</div>\n<div> </div>\n<div>I also knew that if I quit, it would gnaw at me and I'd eventually find myself back out here, except with full knowledge of how awful it would be to my body, and having to save and plan and quit my job and put my things in storage all over again.</div>\n<div> </div>\n<div>My feet screamed at me every morning, every night, every time I took a break, every time I got up from taking a break, literally every step: stop. Stop. Stop.Though I considered the idea, I couldn't. I wished I could. (To this day, in some ways, part of me wishes I could have quit and saved my feet. But I am stubborn to a fault.)</div>\n<div> </div>\n<div>The traits I'd always had, which endurance sport training had further helped solidify, suddenly became foundational pillars of my day to day: endure. Adapt.</div>\n<div> </div>\n<div>But there was still so much pain, and I felt bitterness and resentment at my fellow hikers who had comparatively simple problems to manage--blisters, occasional injuries from falls, but nothing lingering.</div>\n<div> </div>\n<div>The hikers with feet like mine quit. That's what they did.</div>\n<div> </div>\n<div>In Virginia, as I stopped hiking or even camping with any of my tramily, I started to descend to really dark places. It was so unfair. This wasn't the hike I'd signed up for. This sucked.</div>\n<div> </div>\n<div>Two events changed my perspective. I can't remember the order, I will have to check my journals, but:</div>\n<ol>\n<li>I met Repeat and Three-Mile. Three-Mile, on his second attempt, trying to manage his fibromyalgia, already having had to take a break to see his doctors. I really only saw them a couple days, and we camped together one night (I shared my Sourpatch Kids with them). I asked him how he managed thru-hiking with fibromyalgia, how on earth he made that work. And we got into this conversation about the importance of the mind, and perspective. As he put it to me: \"It's like you're driving a bus. Your feet stepping on the ground are going on the gas and the brake, your hands on your hiking poles are like they're the steering wheel. You can't control what comes down the road at you, but you know what you can control? What you allow ON your bus.\" It was one of the more concrete explanations of deliberate focus and mindfulness I'd ever heard, and it came at a time when I desperately needed that perspective.</li>\n<li>My dad met me in Shenandoah National Park. We ate meals together, gave my friends trail magic, shared two different hotel rooms, drove portions of the scenic drive. I talked about my feet, how hard it was. He watched me get out of bed and almost fall over, have to use walls to help me stand up and balance until my feet \"woke up\" for the day. The last morning as we ate breakfast before parting ways, he looked at me over the table and said: \"I wish you were having more fun.\" It was like someone had punched me in the stomach. I wanted to cry. Instead, Dad dropped me back on trail, on a foggy, rainy day in the Shenandoahs when you couldn't see any of the beautiful views. And I started sobbing and talking to my dead mother as I went.</li>\n</ol>\n<div> </div>\n<div>I knew that I had lost my joy and enthusiasm. That I had let the pain and the struggle dominate my thoughts, and the more of my time and effort I put focusing on them, the larger they loomed.</div>\n<div> </div>\n<div>I worked to refocus myself to things that kept me more in the moment: photographing mushrooms (one of my day-hiking hobbies), saying \"Hi, little red eft\" to every red eft I saw on trail, shifting to as much solo stealth camping as I could to pick beautiful places to eat dinner and sleep.</div>\n<div> </div>\n<div>As I did this, I realized that what I had to let go of was the hike I thought I'd have. I had to embrace and hike the hike that I'd been given, instead. I never did a 30-mile day, never pulled the massive individual daily endurance efforts I imagined. I took frequent breaks, my pace was slower, I camped in weird places and soaked my feet in a lot of very cold water crossings. It forced me out of my body, in many ways. And when it was negative, I spent a lot of time in my head, in very neurotic places there. But as I consciously shifted my focus to the present and to accepting the hike I'd been given, this shifted me more into my heart, to remind myself how grateful I was for this opportunity.</div>\n<div> </div>\n<div>From then on, the worse my feet got (and they got quite bad), I told myself when I got up that I needed to treat the day as if it were my last day on trail. How would I want to spend my last day on trail? Miserable? Or joyful? That constant reminder of just how fragile and tenuous my hike was forced a different attitude and appreciation.</div>\n<div> </div>\n<div>In the end, my hike was much richer for it. I have watched snakes swim across Maine ponds, hung in my hammock with no human anywhere nearby through thunderstorms, watched the moon from my hammock. If I'd been pulling huge miles and taking fewer breaks, I don't know that I would have done as many of these things, or noticed them as much when I did, as I soaked my feet.</div>\n<div> </div>\n<div>My hike took 5.5 months.</div>\n<div> </div>\n<div>And there isn't a day now that I don't wish I wasn't back out there.</div>\n<div> </div>\n<div>Fast-forward 3 years, to 2021. It's about a month after the three-year trailiversary of finishing my thru-hike. I've had long Covid since I got sick with it in the end of March 2020. My body, once an endurance machine, is a constant roulette game: some days I feel okay, some days I have shortness of breath from having a conversation, often I'm totally exhausted. I haven't had a real workout in over a year, since they seemed to cause flares of the worst issues.</div>\n<div> </div>\n<div>In short, this life is not the life I expected to have.</div>\n<div> </div>\n<div>I can't say that I've been able to fully accept the life that long Covid has given me, yet. No one knows if this will last forever, if I might \"get better,\" and that uncertainty makes it rocky. Some days I am full of rage or sadness or depression or bleakness. Some days I do inch my way toward acceptance.</div>\n<div> </div>\n<div>The red efts are harder to find, basically nonexistent where I live. But I have a daily short hike with my dog Zola, and we look for mushrooms, and her sheer joy at being out on trail is infectious. This isn't the life or the hike that I expected or wanted. No one would choose this. But I am doing my best to live it to the fullest extent I can, within the ever-shifting parameters of my now chronically ill body.</div>\n<div> </div>\n<div>On the rough days, sometimes, I mutter to myself: \"Hike the hike you've been given, Sass.\" And I try to remember who Sassafras was, what she accomplished, and to remind myself that no matter what my body does, *I am still that hiker with sass*. No virus can take away that experience, that mindset, that tremendous accomplishment, that fortitude. I may be stuck on an endless endurance effort with no Katahdin ever in sight--and a dwindling sense that there will ever be a Katahdin, here--but I can still try to face each day as if it's my last on this adventure.</div>\n<div> </div>\n<div>Hi, little red eft.</div>",
            "image": "http://www.livewithsass.com/media/posts/1/IMG_20180508_170133.jpg",
            "author": {
                "name": "Kate / Sassafras"
            },
            "tags": [
                   "longhaulerwithsass",
                   "hikerwithsass"
            ],
            "date_published": "2021-11-21T16:43:00-05:00",
            "date_modified": "2022-03-18T18:39:22-04:00"
        }
    ]
}
